/*Задача 41: Пользователь вводит с клавиатуры M чисел. 
Посчитайте, сколько чисел больше 0 ввёл пользователь.*/
/*Console.Write("Введите необходимые числа, после закончите операцию нажав enter");
int size = 0;
string c = Console.ReadLine();
while (c!= string.Empty)
{
    int[] array = new int[size];
    int b=Convert.ToInt32(c);
    array[size]=b;
    size++;
}
*/
/*Задача 43: Напишите программу,
 которая найдёт точку пересечения двух прямых, 
 заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
значения b1, k1, b2 и k2 задаются пользователем.*/
/*void func(double x1, double y1, double x2, double y2)
{
    double x = (y2 - y1) / (x1 - x2);
    double y = x1 * x + y1;

    x = Math.Round(x, 3);
    y = Math.Round(y, 3);

    Console.WriteLine($"intersection at a point: ({x};{y})");
}
Console.Write("Input x1: ");
double x1 = Convert.ToDouble(Console.ReadLine());
Console.Write("Input y1: ");
double y1 = Convert.ToDouble(Console.ReadLine());
Console.Write("Input x2: ");
double x2 = Convert.ToDouble(Console.ReadLine());
Console.Write("Input y2: ");
double y2 = Convert.ToDouble(Console.ReadLine());
func(x1, y1, x2, y2);*/